Model: "sequential_29"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d_115 (Conv1D)         (None, 31703, 128)        1536      
                                                                 
 spatial_dropout1d_72 (Spati  (None, 31703, 128)       0         
 alDropout1D)                                                    
                                                                 
 conv1d_116 (Conv1D)         (None, 10565, 64)         90176     
                                                                 
 spatial_dropout1d_73 (Spati  (None, 10565, 64)        0         
 alDropout1D)                                                    
                                                                 
 conv1d_117 (Conv1D)         (None, 2112, 8)           4616      
                                                                 
 spatial_dropout1d_74 (Spati  (None, 2112, 8)          0         
 alDropout1D)                                                    
                                                                 
 conv1d_118 (Conv1D)         (None, 420, 64)           6720      
                                                                 
 spatial_dropout1d_75 (Spati  (None, 420, 64)          0         
 alDropout1D)                                                    
                                                                 
 conv1d_119 (Conv1D)         (None, 83, 32)            18464     
                                                                 
 dropout_59 (Dropout)        (None, 83, 32)            0         
                                                                 
 flatten_30 (Flatten)        (None, 2656)              0         
                                                                 
 dense_88 (Dense)            (None, 32)                85024     
                                                                 
 dense_89 (Dense)            (None, 1)                 33        
                                                                 
=================================================================
Total params: 206,569
Trainable params: 206,569
Non-trainable params: 0
_________________________________________________________________
